Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: This includes using strategies to make oneself understood, switching between formal and informal language and combining forms of expression like text, images and oral descriptions.
nb: Det inkluderer også å bruke strategier for å gjøre seg forstått, veksle mellom formelt og uformelt språk og kombinere uttrykksformer som tekst, bilder og muntlige beskrivelser.

source: Have you come to look at the apartment?
nb: Har du hørt at Anna er sykemeldt?

source: • describe experiences, events and expectations in a nuanced and precise
nb: • beskrive erfaringer, hendelser og forventninger på en nyansert og presis

source: European Competence Standards for the Academic Training of Career Practitioners.
nb: Den ledes av Kompetanse Norge, og har som formål å drøfte og diskutere aktuelle innsatsområder og strategier.

source: Accessibility and accommodation
nb: Tilrettelegging og tilgjengelighet

source: Sean Dowling (2013) also looks at how blogs can support language learning.
nb: Også Sean Dowling (2013) undersøker hvordan blogg kan støtte opp under språkopplæringen.

source: Many of the participants on this course had dropped out, which, according to Xiao, is not unusual for online courses.
nb: Mange deltakere i dette kurset hadde droppet ut, noe som ifølge Xiao ikke er uvanlig i nettba-sert kurs.

source: Important elements of the classes include dialogue, concept learning, exercises and assignments, everyday examples and continuous assessment.
nb: Viktige elementer i timene vil være samtaler, begrepslæring, øvelser og oppgaver, hverdagseksempler og underveisvurdering:

source: • participate in formal training and certification
nb: • svare på spørsmål knyttet til opplæring og sertifisering

source: They have applied for separation, and Patrick has moved into a flat not far from Maria.
nb: har søkt om separasjon, og Patrick har flyttet til en leilighet ikke så langt fra Maria.

source: • employ reading strategies such as understanding words based on the
nb: • bruke lesestrategier som å forstå ord ut fra konteksten når temaet er kjent,

source: Monica Reichenberg, who conducts research on reading among immigrants in Sweden, among other things, has studied immigrants’ use of Swedish news media (Reichenberg, 2016).
nb: Monica Reichenberg, som blant annet forsker på lesing blant immigranter i Sverige, har studert innvandreres bruk av svenske (nyhets)medier (Reichenberg, 2016).

source: audiovisual material, e.g. news broadcasts, podcasts and films;
nb: materiale, for eksempel nyhetssendinger, podkaster og filmer

source: If you are entitled to take one test free of charge, but cannot take the test, you have to pay for the next test.
nb: Har du rett til én gratis prøve, men kan ikke ta prøven, må du betale for neste prøve.

source: Reading and writing goals and processes
nb: Lese- og skriveforberedende mål og prosesser

source: • read voyage recorder for longer trips and trips outside
nb: • Kan lese og forstå enkle fortellinger og eventyr

source: • understand the meaning of simple illustrations, images, pictograms, icons
nb: • forstå betydningen av enkle illustrasjoner, bilder, piktogrammer, ikoner og

source: • take notes from training courses and programs
nb: • bruke spesielle ord og uttrykk knyttet til reindriftsfaget

source: Level C1 has a separate curriculum and can be found at the Lovdata website.
nb: Nivå C1 er fastsatt som en egen læreplan og finnes i Lovdata.

source: Altunay, who has asked the students about ‘learning activities’ they regularly do outside their classes, concludes that as few as 9% of the participants read English-language (online) newspapers, and only 12% use English-language learning websites.
nb: Altunay, som har spurt studentene om «læringsaktiviteter» de pleier å gjøre utenom timene, slår fast at så få som 9% av deltakerne leser engelskspråklige (nett)aviser og bare 12% bruker engelskspråklige språklæringssider på nett.

source: The training will improve participants’ digital judgement and strategies for internet use and to evaluate and use different digital tools to support communication and learning Norwegian.
nb: Opplæringen skal bidra til å styrke deltakernes digitale dømmekraft og strategier for nettbruk og til å vurdere og bruke ulike digitale verktøy som støtte i kommunikasjon og læring av norsk.

source: • write reports and minutes related to their own occupation and areas of
nb: • skrive rapporter og referater knyttet til eget fag- og interessefelt
